trunk/performance/latency/GSOAP/Latency/latency.latencyNestedArray.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:latency">
 <SOAP-ENV:Body>
  <ns:latencyNestedArray>
   <ns:in SOAP-ENC:arrayType="Outer[1]">
    <ns:item>
     <length>0</length>
     <inner-array SOAP-ENC:arrayType="Inner[1]">
      <item>
       <info></info>
       <index>0</index>
      </item>
     </inner-array>
    </ns:item>
   </ns:in>
  </ns:latencyNestedArray>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
